
### Import the necessary libraries`

In [1]:
import pandas as pd
import numpy as np
import scipy.stats as stats

### 1. A physician is evaluating a new diet for her patients with a family history of heart disease. To test the effectiveness of this diet, 16 patients are placed on the diet for 6 months. Their weights and triglyceride levels are measured before and after the study, and the physician wants to know if either set of measurements has changed. (Data set: dietstudy.csv)

In [16]:
dietstudy = pd.read_csv("dietstudy.csv")
dietstudy.head()

   patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0      1   45    Male  180  148  106  113  100   198   196   193   188   192
1      2   56    Male  139   94  119   75   92   237   233   232   228   225
2      3   50    Male  152  185   86  149  118   233   231   229   228   226
3      4   46  Female  112  145  136  149   82   179   181   177   174   172
4      5   64    Male  156  104  157   79   97   219   217   215   213   214

Hypothesis Testing Steps:

Step-1: Indentify the problem:- Want to know if either set of measurements has changed or not before and after new diet.
        
Step-2: Step-2: Describe the Hypothesis:- 
        For weights
        Ho: initial weight(wgt0) == final weight(wgt4)
        Ha: initial weight(wgt0) <> final weight(wgt4)
            
        For triglyceride levels
        Ho: initial triglyceride level(tg0) == final triglyceride level(tg4)
        Ha: initial triglyceride level(tg0) <> final triglyceride level(tg4)
        
        
Step-3: Statistical Test:- Two sample t test because we are comparing continous and continous variables.

In [3]:
#For Weights
stats.ttest_rel(a=dietstudy.wgt0,b=dietstudy.wgt4)
#here pvalue is 1.137689414996614e-08 which is less than 0.05

Ttest_relResult(statistic=11.174521688532522, pvalue=1.137689414996614e-08)

In [4]:
#For triglyceride levels
stats.ttest_rel(a=dietstudy.tg0,b=dietstudy.tg4)
#here pvalue is 0.24874946576903698 which is more than 0.05

Ttest_relResult(statistic=1.2000008533342437, pvalue=0.24874946576903698)

step-4: Statistical Score:- T score

step-5: Decide:- 
        For weights
        as pvalue(1.137689414996614e-08)<0.05 which implies reject null hypothesis accept alternative hypothesis
        
        For triglyceride levels
        as pvalue(0.25)>0.05 which implies fail to reject null hypothesis reject alternative hypothesis
        

So, 
    In terms of Weights, the measurement before and after new diet is changed.
    In terms of Triglyceride levels, the measurement before and after new diet is not changed.

### 2. An analyst at a department store wants to evaluate a recent credit card promotion. To this end, 500 cardholders were randomly selected. Half received an ad promoting a reduced interest rate on purchases made over the next three months, and half received a standard seasonal ad. Is the promotion effective to increase sales?  (Data set: creditpromo.csv)

In [17]:
creditPromo = pd.read_csv("creditpromo.csv")
creditPromo.head()

     id         insert      dollars
0   148       Standard  2232.771979
1   572  New Promotion  1403.807542
2   973       Standard  2327.092181
3  1096       Standard  1280.030541
4  1541  New Promotion  1513.563200

In [6]:
#Parameters taken into considerations are sales(dollars column) for new promotion and standard.

creditPromo_new_promo = creditPromo.copy()
creditPromo_new_promo = creditPromo_new_promo.loc[(creditPromo_new_promo["insert"]=="New Promotion"),["dollars"]]
#creditPromo_new_promo.head()

creditPromo_std = creditPromo.copy()
creditPromo_std = creditPromo_std.loc[(creditPromo_std["insert"]=="Standard"),["dollars"]]

Hypothesis Testing Steps:

Step-1: Indentify the problem:- Is the credit card promotion effective to increase sales?

Step-2: Describe the Hypothesis:- 
        Ho: new promo sales == standard sales
        Ha: new promo sales > standard sales
        
Step-3: Statistical Test:- Two sample independent t test because we are comparing continous and categorical variable of two different categories.

In [7]:
# as we don't have an idea whether they are independent or not so we taking both the cases

#case 1
stats.ttest_ind(a=creditPromo_new_promo,b=creditPromo_std,equal_var=True)

Ttest_indResult(statistic=array([2.26042273]), pvalue=array([0.024226]))

In [8]:
#case 2
stats.ttest_ind(a=creditPromo_new_promo,b=creditPromo_std,equal_var=False)

Ttest_indResult(statistic=array([2.26042273]), pvalue=array([0.02422635]))

As in both the cases t score is same so we are going to consider case 1.

step-4: Statistical Score: T score
    
step-5: Decide: As pvalue(0.024)<0.05 which implies we rejecy null hypothesis and accept alternative hypotheses.
        
So, the credit card promotion effective to increase sales.

### 3. An experiment is conducted to study the hybrid seed production of bottle gourd under open field conditions. The main aim of the investigation is to compare natural pollination and hand pollination. The data are collected on 10 randomly selected plants from each of natural pollination and hand pollination. The data are collected on fruit weight (kg), seed yield/plant (g) and seedling length (cm). (Data set: pollination.csv) 
 ### a. Is the overall population of Seed yield/plant (g) equals to 200?

In [18]:
pollination=pd.read_csv("pollination.csv")
pollination.head()

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90

Hypothesis Testing Steps

step-1: Indetify the problem:- Is the overall population of Seed yield/plant(g) equals to 200?

step-2: Describe the hypothesis:
        Ho: seed yield/plant  == 200
        Ha: seed yield/plant  <> 200
        
step-3: Statistical Test:- One sample t test because we are comparing continous variable with hypothesised value.

In [10]:
stats.ttest_1samp(a=pollination.Seed_Yield_Plant,popmean=200)

Ttest_1sampResult(statistic=-2.3009121248548645, pvalue=0.032891040921283025)

step-4: Statistical Score:- T score

step-5: Decide:- as pvalue(0.033)<0.05 which implies reject null hypothesis accept alternative hypothesis

So, the overall population of Seed yield/plant(g) not equals to 200.

 ### b. Test whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.

In [11]:
pollination_natural=pollination.copy()
pollination_natural=pollination_natural.loc[(pollination_natural["Group"]=="Natural"),]

pollination_hand=pollination.copy()
pollination_hand=pollination_hand.loc[(pollination_hand["Group"]=="Hand"),]

Hypothesis Testing Steps

step-1: Indentify the problem:- Whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.

step:2: Describe the hypothesis:
        Ho: natural pollination fruit weight == hand pollination fruit weight
            natural pollination seed yield/plant == hand pollination seed yield/plant
            natural pollination seedling length == hand pollination seedling length
            
        Ha: natural pollination fruit weight <> hand pollination fruit weight
            natural pollination seed yield/plant <> hand pollination seed yield/plant
            natural pollination seedling length <> hand pollination seedling length
            
            
Step-3: Statistical Test: 2 sample t test because we are comparing two continous variables

In [13]:
#case 1: comparing on the basis of fruit weight
stats.ttest_rel(a=pollination_natural.Fruit_Wt,b=pollination_hand.Fruit_Wt)

Ttest_relResult(statistic=-16.003484109505287, pvalue=6.420421224715851e-08)

In [14]:
#case 2: comparing on the basis of seed yield/plant
stats.ttest_rel(a=pollination_natural.Seed_Yield_Plant,b=pollination_hand.Seed_Yield_Plant)

Ttest_relResult(statistic=-16.80079294985747, pvalue=4.198813240596638e-08)

In [15]:
#case 3: comparing on the basis of seedling length
stats.ttest_rel(a=pollination_natural.Seedling_length,b=pollination_hand.Seedling_length)

Ttest_relResult(statistic=-2.9765905136151303, pvalue=0.015535315669362245)

step-4: Statistical score: t score

step-5: Decise:- In all three cases pvalue([6.420421224715851e-08,4.198813240596638e-08,0.0155])<0.05 which implies reject null hypothesis accept alternative hypothesis

So, the natural pollination and hand pollination under open field conditions are significantly different.

### 4. An electronics firm is developing a new DVD player in response to customer requests. Using a prototype, the marketing team has collected focus data for different age groups viz. Under 25; 25-34; 35-44; 45-54; 55-64; 65 and above. Do you think that consumers of various ages rated the design differently? (Data set: dvdplayer.csv).

In [19]:
dvdplayer=pd.read_csv("dvdplayer.csv")
dvdplayer.head()

      agegroup   dvdscore
0  65 and over  38.454803
1        55-64  17.669677
2  65 and over  31.704307
3  65 and over  25.924460
4     Under 25  30.450007

In [20]:
dvdscore_under_25 = dvdplayer.copy()
dvdscore_under_25=dvdscore_under_25.loc[(dvdscore_under_25["agegroup"]=="Under 25"),["dvdscore"]]

dvdscore_25_34 = dvdplayer.copy()
dvdscore_25_34=dvdscore_25_34.loc[(dvdscore_25_34["agegroup"]=="25-34"),["dvdscore"]]

dvdscore_35_44 = dvdplayer.copy()
dvdscore_35_44=dvdscore_35_44.loc[(dvdscore_35_44["agegroup"]=="35-44"),["dvdscore"]]

dvdscore_45_54 = dvdplayer.copy()
dvdscore_45_54=dvdscore_45_54.loc[(dvdscore_45_54["agegroup"]=="45-54"),["dvdscore"]]

dvdscore_55_64 = dvdplayer.copy()
dvdscore_55_64=dvdscore_55_64.loc[(dvdscore_55_64["agegroup"]=="55-64"),["dvdscore"]]

dvdscore_65_over = dvdplayer.copy()
dvdscore_65_over=dvdscore_65_over.loc[(dvdscore_65_over["agegroup"]=="65 and over"),["dvdscore"]]

Hypothesis Testing Steps

step-1: Indetify the problem:- whether the consumers of various ages rated the design differently or significantly equal?

step-2: Describe the hypothesis:-
        Ho: people Under 25 dvdscore == people 25-34 dvdscore == people 35-44 dvdscore == people 45-54 dvdscore == people 55-64 dvdscore == people 64 above dvdscore
        
        Ha: people Under 25 dvdscore <> people 25-34 dvdscore <> people 35-44 dvdscore <> people 45-54 dvdscore <> people 55-64 dvdscore <> people 64 above dvdscore
        
step-3: Statistical test: F test or ANOVA because comparing continous and categorical variable with more than two categories

In [21]:
stats.f_oneway(dvdscore_under_25,dvdscore_25_34,dvdscore_35_44,dvdscore_45_54,dvdscore_55_64,dvdscore_65_over)

F_onewayResult(statistic=array([6.99252696]), pvalue=array([3.08732491e-05]))

step-4: Statistical score:- F value
        
step-5: Decide:- as pvalue(3.08732491e-05)<0.05 which implies reject null hypothesis accept alternative hypothesis.

So, the consumers of various ages rated the design differently.

### 5. A survey was conducted among 2800 customers on several demographic characteristics. Working status, sex, age, age-group, race, happiness, no. of child, marital status, educational qualifications, income group etc. had been captured for that purpose. (Data set: sample_survey.csv).

In [22]:
sample_survey=pd.read_csv("sample_survey.csv")
sample_survey.head()

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean

 ### a. Is there any relationship in between labour force status with marital status?

In [23]:
sample_survey_a=sample_survey.copy()

sample_survey_a.wrkstat.fillna(sample_survey_a.wrkstat.mode()[0])
sample_survey_a.marital.fillna(sample_survey_a.marital.mode()[0])
sample_survey_a.head()

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean

Hypothesis Testing Steps

step-1: Indetify the problem:- Is there any relationship in between labour force status with marital status?

step-2: Describe the hypothesis:
        Ho: Observed values == Expected Values
            (Variables are not influencing each other)
        Ha: Observed values <> Expected Values
            (Variables are influencing each other)
        
step-3: Statistical Test:- Chi Square test because we are comparing two categorical variables.

In [25]:
crossTab = pd.crosstab(sample_survey_a.wrkstat, sample_survey_a.marital, margins = True)
crossTab

marital,Divorced,Married,Never married,Separated,Widowed,All
wrkstat,,,,,,
Keeping house,25,200,35,13,55,328
Other,12,16,14,4,8,54
Retired,53,168,17,6,150,394
School,7,9,60,2,1,79
Temporarily not working,9,23,11,1,2,46
"Unemployed, laid off",10,13,32,0,3,58
Working full time,295,778,392,58,44,1567
Working part-time,35,138,102,9,20,304
All,446,1345,663,93,283,2830

In [27]:
stats.chi2_contingency(observed=crossTab)

(729.2421426572284,
 1.820339965538765e-127,
 40,
 array([[5.16918728e+01, 1.55886926e+02, 7.68424028e+01, 1.07787986e+01,
         3.28000000e+01, 3.28000000e+02],
        [8.51024735e+00, 2.56643110e+01, 1.26508834e+01, 1.77455830e+00,
         5.40000000e+00, 5.40000000e+01],
        [6.20932862e+01, 1.87254417e+02, 9.23045936e+01, 1.29477032e+01,
         3.94000000e+01, 3.94000000e+02],
        [1.24501767e+01, 3.75459364e+01, 1.85077739e+01, 2.59611307e+00,
         7.90000000e+00, 7.90000000e+01],
        [7.24946996e+00, 2.18621908e+01, 1.07766784e+01, 1.51166078e+00,
         4.60000000e+00, 4.60000000e+01],
        [9.14063604e+00, 2.75653710e+01, 1.35879859e+01, 1.90600707e+00,
         5.80000000e+00, 5.80000000e+01],
        [2.46954770e+02, 7.44740283e+02, 3.67109894e+02, 5.14950530e+01,
         1.56700000e+02, 1.56700000e+03],
        [4.79095406e+01, 1.44480565e+02, 7.12197880e+01, 9.99010601e+00,
         3.04000000e+01, 3.04000000e+02],
        [4.46000000e+02, 1.34500000e+03, 6.63000000e+02, 9.30000000e+01,
         2.83000000e+02, 2.83000000e+03]]))

step-4: Statistical value: Chi2 value

step-5: Decide:- As pvalue(7.424404099753273e-15)<0.05 which implies reject null hypothesis accept alternative hypothesis.

So, there is a relationship in between labour force status with marital status

 #### b. Do you think educational qualification is somehow controlling the marital status?

In [29]:
sample_survey_b=sample_survey.copy()

sample_survey_b.degree.fillna(sample_survey_b.degree.mode()[0])
sample_survey_b.marital.fillna(sample_survey_b.marital.mode()[0])


crosstab = pd.crosstab(sample_survey_b.degree,sample_survey_b.marital,margins=True)
crosstab

marital         Divorced  Married  Never married  Separated  Widowed   All
degree
Bachelor              58      251            129         12       28   478
Graduate              29      123             41          3        9   205
High school          241      686            367         58      148  1500
Junior college        45      108             46          3        6   208
LT High school        70      174             77         17       92   430
All                  443     1342            660         93      283  2821

Hypothesis Testing Steps

step-1: Identify the problem:- Is educational qualification  somehow controlling the marital status?

step-2: Describe the hypothesis:
        Ho: Observed values == Expected Values
            (Variables are not influencing each other)
        Ha: Observed values <> Expected Values
            (Variables are influencing each other)
            
step-3: Statistical test: Chi square test because we are finding the relationship between two categorical variables.

In [30]:
stats.chi2_contingency(observed=crosstab)

(122.68449020508541,
 7.424404099753273e-15,
 25,
 array([[  75.06345268,  227.39312301,  111.83268345,   15.75824176,
           47.95249911,  478.        ],
        [  32.19248493,   97.52215526,   47.9617157 ,    6.75824176,
           20.56540234,  205.        ],
        [ 235.55476781,  713.57674583,  350.9393832 ,   49.45054945,
          150.4785537 , 1500.        ],
        [  32.66359447,   98.94930876,   48.66359447,    6.85714286,
           20.86635945,  208.        ],
        [  67.52570011,  204.55866714,  100.60262318,   14.17582418,
           43.1371854 ,  430.        ],
        [ 443.        , 1342.        ,  660.        ,   93.        ,
          283.        , 2821.        ]]))

step-4: Statistical value: Chi2 value

step-5: Decide:- As pvalue(7.424404099753273e-15)<0.05 which implies reject null hypothesis accept alternative hypothesis.

So, Educational qualification is somehow controlling the marital status.

###  c. Is happiness is driven by earnings or marital status?

In [31]:
#Parameters taken into consideration are happiness(sample_survey.happy) and marital status(sample_survey.marital)
sample_survey_c1=sample_survey.copy()

sample_survey_c1.happy.fillna(sample_survey_c1.happy.mode()[0])
sample_survey_c1.marital.fillna(sample_survey_c1.marital.mode()[0])


crosstab=pd.crosstab(sample_survey_c1.happy,sample_survey_c1.marital,margins=True)
crosstab

marital        Divorced  Married  Never married  Separated  Widowed   All
happy
Not too happy        72       71            108         30       59   340
Pretty happy        278      684            426         49      137  1574
Very happy           93      582            120         13       83   891
All                 443     1337            654         92      279  2805

Hypothesis Testing Steps

step-1: Identify the problem:- Is happiness is driven by marital status?
        
step-2: Describe the hypothesis:
        Ho: Observed values == Expected Values
            (Variables are not influencing each other)
        Ha: Observed values <> Expected Values
            (Variables are influencing each other)
            
step-3: Statistical test: Chi square test because we are finding the relationship between two categorical variables.

In [32]:
stats.chi2_contingency(observed=crosstab)

(260.68943894182826,
 7.762777322980048e-47,
 15,
 array([[  53.6969697 ,  162.06060606,   79.27272727,   11.15151515,
           33.81818182,  340.        ],
        [ 248.58538324,  750.24527629,  366.98609626,   51.62495544,
          156.55828877, 1574.        ],
        [ 140.71764706,  424.69411765,  207.74117647,   29.22352941,
           88.62352941,  891.        ],
        [ 443.        , 1337.        ,  654.        ,   92.        ,
          279.        , 2805.        ]]))

step-4: Statistical value: Chi2 value

step-5: Decide:- As pvalue(7.234749067043371e-21)<0.05 which implies rehect null hypothesis accept alternative hypothesis.

So, Happiness is also driven by earnings.